'number' + 3 + 3// =number33 , тут відбувається конкатенацию строк, і виходить number+3+3=number33

null + 3-//=3, тому що null преобразується у 0, та 0 + 3 =3

5 && "qwerty"//=qwerty, тому що && буде шукати перше ложне значення , а так як і 5 і "qwerty" істинна , то поверне останнє значення 

+'40' + +'2' + "hillel";//=42hillel,тому що + перед строкою перетворює на число тому виходить 40+2 = 42 , та потім йде конкатенація із строкою і виходить 42+"hillel"=42hillel

'10' - 5 === 6;//=false ,тому що "10" - 5 = 5(бо мінус перетворює строку на число) та 5 не дорівнює 6 тому це буде false

true + false//=1, тому що true=1,false=0, та 1+0=1

'4px' - 3//=NaN,тому що - перетворює строку в число але 4px неможливо перевести в число , тому це буде NaN

'4' - 3//=1 тому що - перетворює строку в число і буде 4-3=1

'6' + 3 ** 0;//=61, тому що 3 в нульовій степені =1 та через + відбувається конкатенація і виходить =61

12 / '6'//=2, тому що поділ також приводить до числа і виходить 12/6=2

'10' + (5 === 6);//=10false, тому що 5===6 це буде false та відбувається конкатенація і це буде 10false

null == ''//=false, тому що null та '' це різні типи значень

3 ** (9 / 3);//=27 , тому що 9/3=3 та 3 в 3 ступені це 27

!!'false' == !!'true'//=true, тому що !! перетворює значення на булевий тип , абудь-яка не пуста строка =true тому виходить що true == true=true

0 || '0' && 1//1, тому що у && більш пріорітетний ніж || і виходить що '0' && 1=1 тому що "0" це строка і дорівнює 1 і тоді беремо останнє значення і 0 || 1 = 1 тому що || повертає преше істення значення 

(+null == false) < 1;//=false, тому що +null= 0 ,false=0 0 == 0 = true, a true= 1 і виходить 1<1=false

false && true || true//=true , тому що && шукає перше ложне і false && true = false , і || шукає перше істинне і false || true = true 

false && (false || true);//false , тому що хоч && і прірітетніший але || у дужках тому спочатку рахуєм || ,false || true = true , так як шукаєм перше істенне , і false && true  = false,тому що шукаєм перше ложне 

(+null == false) < 1 ** 5;//false , тому що (+null == false) = true як у прикладі вище , 1 у 5 ступені це 1, і 1 < 1 =false